chapter-1-2/app/views/users/show.html.erb

<p>First Micropost</p>
<%= @user.microposts.first.content %>
---
SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ? ORDER BY "microposts"."id" ASC LIMIT ?  [["user_id", 1], ["LIMIT", 1]]